const languageFile = {

    features: {
        '.f1 h3': {
            uk: 'Сертифікат',
            rus: 'Сертификат'
        },
        '.f1 p': {
            uk: 'Після завершення курсу ви отримаєте сертифікат, який згодом зможете продемонструвати на співбесіді',
            rus: 'По истечении курса вы получите сертификат об окончании, который в дальнейшем сможете продемонстрировать на собеседовании'
        },
        '.f2 h3': {
            uk: 'Досвідчені викладачі',
            rus: 'Опытные преподаватели'
        },
        '.f2 p': {
            uk: 'У нашій академії викладають лише досвідчені професіонали, які допоможуть вам реалізуватись у сфері IT ',
            rus: 'В нашей академии преподают только опытные профессионалы, которые помогут вам реализоваться в сфере IT'
        },
        '.f3 h3': {
            uk: 'Вчиться де завгодно',
            rus: 'Учитесь где угодно'
        },
        '.f3 p': {
            uk: 'На період карантну всі курси проводяться дистанційно. Це означає, що ви можете вчитись із будь-якої точки світу',
            rus: 'В период карантина все курсы проводятся удалённо. Это означает, что вы можете учиться из любой точки мира'
        },
    },
    smailMenu: {
        h2: {
            uk: 'GOOD WEB довіряють понад 1000 студентів',
            rus: "GOOD WEB доверяют более 1000 студентов."
        },
        p: {
            uk: 'За час існування академії наші курси пройшли більше 1000 студентів по всьому світу. Наші випускники досягають реальних успіхів у програмуванні, чого ми бажаємо й вам. Ми допомогаємо кращим випускникам успішно почати кар`єру в IT ',
            rus: "За время существования академии наши курсы прошли более 1000 студентов по всему миру. Наши выпускники добиваются реальных успехов в программировании, чего мы желаем и вам. Мы помогаем лучшим выпускникам успешно начать карьеру в IT"
        },
    },
    fact: {
        '.f1': {
            uk: 'Випускників',
            rus: 'Выпускников'
        },
        '.f2': {
            uk: 'Досвідчених викладачів',
            rus: 'Опытных преподавателей'
        },
        '.f3': {
            uk: 'Годин навчання',
            rus: 'Часов обучения'
        },
        '.f4': {
            uk: 'Наших студентів працевлаштовуються',
            rus: 'Наших студенов трудоустраиваются'
        },
    },
    courses: {
        h2: {
            uk: 'Наші курси',
            rus: 'Наши курсы'
        },
    },
    about: {
        '.f1': {
            uk: 'Твій розвиток не закінчується після навчання. Ти стаєш частиною найбільшої IT-спільноти.',
            rus: 'Твое развитие не заканчивается после обучения. Ты становишься частью крупнейшего ИT-сообщества.'
        },
        '.f2': {
            uk: 'Це нескінченна підтримка від друзів та єдинодумців, котрих ти знайдеш у GOOD WEB ACADEMY. Ось, що по-спавжньому цінно. ',
            rus: 'Это бесконечная поддержка от друзей и единомышленников, которых ты найдешь в GOOD WEB ACADEMY. Вот, что по-настоящему ценно.'
        },
        '.f3': {
            uk: 'Це нові можливості та корисні зустрічі, які прискорять Твій розвиток',
            rus: 'Это новые возможности и полезные встречи, которые придадут ускорение на пути Твоего развития'
        },
    },
    testmonial: {
        h2: {
            uk: 'ВІДГУКИ НАШИХ ВИПУСКНИКІВ',
            rus: 'ОТЗЫВЫ НАШИХ ВЫПУСКНИКОВ',
        },

    },
    contGraficGlob: {
        h2: {
            uk: 'Інфографіка зп',
            rus: 'Инфографика ЗП',
        },
        '.mouth': {
            uk: 'місяць',
            rus: 'месяц'
        },
        '.year': {
            uk: 'років',
            rus: 'лет'
        },
        '.yer': {
            uk: 'року',
            rus: 'года'
        }

    },
    faqs: {
        h2: {
            uk: 'Чому саме ми?',
            rus: 'Почему именно мы?'
        },
        '.f1 h3': {
            uk: '1.Курси вихідного дня',
            rus: '1.Курсы выходного дня'
        },
        '.f1 p': {
            uk: 'Для кожної групи ми підбираємо оптимальний час занять, грунтуючись на потребах учнів',
            rus: 'Для каждой группы мы подбираем оптимальное время занятий, основываясь на потебностях учеников'
        },
        '.f2 h3': {
            uk: '2.Практика',
            rus: '2.Практика'
        },
        '.f2 p': {
            uk: 'Ми надаємо великий обсяг матеріалів для засвоєння',
            rus: 'Мы предоставляем большое количество материалов для усвоения'
        },
        '.f3 h3': {
            uk: '3.Підтримка',
            rus: '3.Поддержка'
        },
        '.f3 p': {
            uk: 'надаємо підтримку та консультації 24/7',
            rus: 'предоставляем поддержку и консультации 24/7'
        },
        '.f4 h3': {
            uk: '4.Гнучкість',
            rus: '4.Гибкость'
        },
        '.f4 p': {
            uk: 'ми враховуємо успішність групи та можемо редагувати учбовий план задля того, щоб ви засвоїли весь матеріал',
            rus: 'Мы учитываем успеваемость группы и можем редактировать учебный план, чтобы вы усвоили весь материал'
        },
        '.f5 h3': {
            uk: '5.Чесність',
            rus: '5.Честность'
        },
        '.f5 p': {
            uk: 'Наша головна ціль - навчити вас, а не відпацювати програму',
            rus: 'Наша главная задача - вас научить, а не отработать программу'
        },
        '.f6 h3': {
            uk: '6.З нуля до працевлаштування',
            rus: '6.С нуля до трудоустройства'
        },
        '.f6 p': {
            uk: 'Ми гарантуємо вам знання та навички, які допоможуть вам заробляти в IT',
            rus: 'Мы гарантируем вам знания и навыки, которые помогут вам зарабатывать в IT'
        },
        '.f7 h3': {
            uk: '7.Сумлінність',
            rus: '7.Добросовестность' // flecksibul
        },
        '.f7 p': {
            uk: 'Якщо подача матеріалу не укладається у встановлений термін, ми готові подовжити заняття та займатися додатковий час',
            rus: 'Если подача материала не укладывается в установленное время, мы готовы продлить занятие и заниматься дополнительное время'
        },
        '.f8 h3': {
            uk: '8.Репетиторство',
            rus: '8.Репетиторство'
        },
        '.f8 p': {
            uk: 'Також є можливість індивідуальних занять з учнем для закріплення матеріалу',
            rus: 'Также имеется возможность индивидуальных занятий с учеником для закрепления материала'
        },
        '.f9 h3': {
            uk: '9.Сертифікація',
            rus: '9.Сертификация'
        },
        '.f9 p': {
            uk: 'Кожному студенту видається сертифікат про закінчення курсу, який він згодом зможе продемонструвати при прийомі на роботу',
            rus: 'Каждому студенту предоставляется сертификат об окончании курса, который он в дальнейшем сможет продемонстрировать при приёме на работу'
        },
    },
    contact: {
        h3: {
            uk: 'Заповніть форму і ми зв`яжемось із вами',
            rus: 'Заполните форму и мы свяжемся с вами'
        }
    },
    whatUs: {
        '.aboutUs h2': {
            uk: "ПОБУДУЙТЕ УСПІШНУ IT КАР`ЄРУ З GOOD WEB ACADEMY",
            rus: 'ПОСТРОЙТЕ УСПЕШНУЮ IT КАРЬЕРУ С GOOD WEB ACADEMY'
        },
        '.whyCont h2': {
            uk: "Чому саме ми?",
            rus: 'Почему именно мы?'
        },
        '.whyCont p': {
            uk: `Ми - IT курси, які в найближчий час стануть повноцінною школою. Наші програми оновлюються кожен рік - таким не можуть похвалитися ні одні курси - ми намагаємось надавати найсвіжіші матеріали. Під час кожного курсу ми беремо до уваги вашу успішність та засвоюваніть, щоб підібрати найбільш оптимальний темп і виклад інформації, так як наша головна ціль - навчити вас, а не відпрацювати запланований матеріал. Ми даємо великий масив практики, тому що саме під час роботи ви будете запам\`ятовувати наш матеріал найкраще. Усі наші курси мають унікальний план та послідовність тем, так як усі наші задачі та домашня робота влаштовані за зростанням рівня важкості. Це означає, що якщо ви будете на 100% слухати все, що говорять під час проходження кожної теми, у вас ніколи не з\`явиться питань з приводу домашньої роботи.
            Більшість альтернативних курсів не можуть таким похвалитися, так як часто стається, що під чса уроку ви розбтраєте всі маетріали дуже швидко і поверхнево, а потім вже дома витрачаєте години часу на те, щоб зрозуміти, що цього на уроці ви не проходили і вам доводиться все е вчити самостійно.
            Кожному студенту надається сертифікат про закінчення курсів, який ві зможе в подальшому продемонструвати при прийомі на роботу.
            `,
            rus: `Мы - IТ курсы, которые в скором времени станут полноценной школой. Наши программы обновляются
            каждый год - таким не могут похвастаться ни одни курсы - мы стараемся преподносить самые свежие
            материлы. Во время каждого курса мы берём во внимание вашу успеваемость и усваиваемость, чтобы
            подобрать наиболее оптимальный темп и подачу информации, так как наша главная задача - научить
            вас, а не отработать запланированный материал. Мы даём большой массив практики, так как именно
            во время работы вы будете запоминать наш материал лучше всего. Все наши курсы имеют уникальный
            план и последовательность тем, так как все наши задачи и домашние работы устроены по наростанию
            уровня сложности. Это значит, что если вы будете на 100% слушать все, что говорится при
            прохождении каждой темы, у вас никогда не возникнет вопросов по поводу домашней работы.

            Большинство альтернативных курсов не могут таким похвастаться, так как часто бывает, что во
            время урока вы разбираете все материалы очень быстро и поверхностно, а потом уже дома тратите
            часы времени на то, чтобы понять, что этого вы на уроке не проходили и вам приходится все это
            учить самостоятельно.
            Каждому студенту предоставляется сертификат об окончании курсов, который он в дальнейшем сможет
            продемонстрировать при приёме на работу`
        },
    },
    maps: {
        '.adres': {
            uk: 'Наша адреса',
            rus: 'Наш  адрес'
        },
        '.GoogleMap': {
            uk: 'Подивитись у Google maps',
            rus: 'Посмотреть в Google maps'
        },
        '.numberH2': {
            uk: 'Номер',
            rus: 'Номер'
        },
        '.shedule': {
            uk: 'Графік роботи',
            rus: 'График работы'
        },
        '.closeOfis': {
            uk: 'Під час карантину наш офіс тимчасово закритий',
            rus: 'Во время карантина наш офис временно закрыт'
        },

    },
    forStudy: {
        '.twoLearned': {
            uk: 'Ми пропонуємо два види навчання в нашому закладі',
            rus: 'Мы предлагаем два вида обучения в нашем учереждении'
        },
        '.studyInGroup': {
            uk: 'Навчання в групі',
            rus: 'Обучение в группе'
        },
        '.studyTrainer': {
            uk: 'Навчання з викладачем',
            rus: 'Обучение с преподавателем'
        },
        '.studyP1': {
            uk: 'Навчання в групі дозволить зануритись в IT з командою єдинодумців, ви зможете ділитись знаннями, підтримувати один одного та вивчати програмування у дружній атмосфері. Також робота в групі допоможе розвити креативне мислення, бо обмінюючись ідеями один з одним, ви будете сприймати інфрмацію з різних точок зору, що сприяє кращому засвоєнню матеріалу. Структурована подача дасть можливість проходити матеріал крок за кроком, завдяки чому ви зможете вивчати матеріал послідовно, не пропускаючи основи при вирішенні складних задач. Також атмосфера здорової конкуренції сприяє успішності в навчанні та впливає якість виконання практичних робіт.',
            rus: `Обучение в группе позволит погрузиться в IT с командой единомышленников, вы сможете делиться знаниями, поддерживать друг друга и изучать программирование в дружеской атмосфере. Так же работа в группе поможет развить креативное мышление, так как делясь идеями друг с другом, вы будете воспринимать информацию с разных точек зрения, что способствует лучшему усвоению метирала. Структирированная подача даст возможность проходить материал шаг за шагом, благодаря чему вы сможете учить материал последовательно, не упуская основы при решении сложных задач. Так же атмосфера здоровой конкуренции благоприятно влияет на успешность в обучении и качество выполнения практических работ.`
        },
        '.planCur': {
            uk: 'Графік',
            rus: 'График'
        },
        '.twoLearned': {
            uk: 'Номер',
            rus: 'Номер'
        },
        '.f1 h4': {
            uk: 'Вечірній час',
            rus: 'Вечернее время'
        },
        '.f1 week': {
            uk: 'Субота, Вівторок, Четвер',
            rus: 'Суббота, Вторник, Четверг'
        },
        '.f2 h4': {
            uk: 'Курс буднього дня',
            rus: 'Курс буднего дня'
        },
        '.f2 week': {
            uk: 'Понеділок, Вівторок, Четвер, П`ятниця',
            rus: 'Понедельник, Вторник Четверг, Пятница'
        },
        '.f3 h4': {
            uk: 'Курс вихідного дня',
            rus: 'Курс выходного дня'
        },
        '.f3 week': {
            uk: 'Субота, Неділя',
            rus: 'Суббота, Воскресенье'
        },
        '.studyP2': {
            uk: 'Індивідуальне навчання - це повне занурення учня у світ IT. Ви будете вивчати матеріал у власному темпі і методами, що підходять саме вам. Це дозволить на 100% зрозуміти предмет і дати максимальний результат у практичній складовій навчання і,безпосередньо, в роботі. Індивідуальний підхід допоможе не тільки покращити результат та сконцентруватися на деталях, але й дасть можливість учителю краще вас зрозуміти, що теж скажеться на якості викладання матеріалу. Ви зможете приділяти кожному питанню стільки часу, скільки потрібно і розбирати кожну тему в найменших подробицях. Ви будете контактувати з викладачем один на один, що не лише покращить якість засвоєння матеріалу, але й зекономить ваш час, адже вся увага буде приділятись вам і вашому прогресу. Індивідуальне навчання, як і групове, означає отримання сертифікату при успішному захисті фінального проекту.',
            rus: 'Индивидуальное обучение - это полное погружение ученика в мир IT.  Вы будете изучать материал в собственном темпе и методами, подходящими именно вам. Это позволит на 100% понять предмет и дать максимальный результат в практической составляющей обучения и, непосредственно, в работе. Индивидуальный подход поможет не только повысить результат и сосредоточиться на деталях, но и даст возможность учителю лучше вас понять, что так же скажется на качестве предоставления материала. Вы сможете уделять каждому вопросу столько времени, сколько нужно и разбирать каждую тему в мельчайших подробностях. Вы будете контактировать с преподавателем один на один, что не только улучшит качество усвоения материала, но и сэкономит вам время, ведь все внимание будет уделяться вам и вашему прогрессу. Индивидуальное обучение, как и групповое, подразумевает получение сертификата при успешной защите финального проекта.'
        },
        '.sheduleMySelf': {
            uk: 'Графік підбирається індивідуально',
            rus: 'график подбирается индивидуально'
        }
    },
    serteficat: {
        '.contCertif h2': {
            uk: 'Сертифікат',
            rus: 'Сертификат'
        },
        '.contCertif p': {
            uk: 'Після успішного завершення нашого курсу вам буде наданий сертифікат. У ньому буде вказана кількість годин, яку продовжувався даний курс(лекції та практика), а також середній бал за час усього навчання. Середній бал складається з виконання домашньої роботи, практики на уроках та контрольних робіт.',
            rus: `После успешного оконачания нашего курса вам будет выдан сертификат. В нем будет указано сколько часов длился данный курс (практика и лекции), а так же средний бал за время всего обучения.
            Средний бал состоит из выполнения домашней работы, практики на уроках и контрольных работ.`
        },
        '.progStudy': {
            uk: 'Пограми навчання вже дописуються для',
            rus: 'Программы обучения уже дописываюся для'
        },
        '.progStudyFuture': {
            uk: 'Програми у найближчий час',
            rus: 'Программы в  ближайшем будущем'
        },
        '.progStudyFuture': {
            uk: 'Програми у найближчий час',
            rus: 'Программы в  ближайшем будущем'
        },
        '.test': {
            uk: 'Тестування',
            rus: 'Тестирование'
        },
        '.ciber': {
            uk: 'Кібербезпека',
            rus: 'Кибербезопасность'
        },
        '.ios': {
            uk: 'IOS розробка',
            rus: 'IOS разработка'
        },
    }

}

setTimeout(() => {
    for (const key in languageFile) {
        const id = document.querySelector('#' + key)
        if('contGraficGlob' === key) {
            console.log(id);
           console.log( document.querySelector('#' + 'contGraficGlob'))
           console.log(document);
        }
        if (id) {
            for (const name in languageFile[key]) {
              
                 const teg  = document.querySelector('#' + key+ ' ' + name)

                //  if(key === 'contact'){
                //      console.group(teg)
                //      console.log(languageFile[key][name][C]);
                //      console.groupEnd()
                //  }

                if(teg){
                    teg.innerHTML = languageFile[key][name][C]
                }
            }
        }
    }
}, 1200)